CS/C++/C++.org
#+SETUPFILE: ../../configOrg/level2.org
#+OPTIONS: H:2 toc:2 num:3 ^:nil
#+TITLES: C++
#+AUTHORs: weiwu
#+begin_src c++

#+end_src


*C++ Premier Plus*

* C++ Basics


** Variables, Operators and Expressions

*** naming


*** logic operation
- --i and i--.
- logical and arithmetic shift.

*** scientific output expression
- use “%10.1f” as format specifier.


* GETTING STARTED
** Learning C++: What Lies Before You
** The Origins of C++: A Little History
** Portability and Standards
** The Mechanics of Creating a Program

* SETTING OUT TO C++
** C++ Initiation
** C++ Statements
*** Comments
- //
- /* */
** More C++ Statements
** Functions



* DEALING WITH DATA
** Simple Variables
*** Variables:

**** common variables names
#+begin_src c++
int price_count_reader;    // No abbreviation.
int num_errors;            // "num" is a widespread convention.
int num_dns_connections;   // Most people know what "DNS" stands for.
#+end_src

**** Class Data Members
Data members of classes, both static and non-static, are named like ordinary nonmember variables, but with a trailing underscore.
#+begin_src c++
class TableInfo {
  ...
 private:
  string table_name_;  // OK - underscore at end.
  string tablename_;   // OK.
  static Pool<TableInfo>* pool_;  // OK.
};
#+end_src

