docs/CS/C++/C++.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-13 Fri 16:32 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
<link rel="stylesheet" type="text/css" href="../../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline5">1. C++ Basics</a>
<ul>
<li><a href="#orgheadline4">1.1. Variables, Operators and Expressions</a></li>
</ul>
</li>
<li><a href="#orgheadline10">2. GETTING STARTED</a>
<ul>
<li><a href="#orgheadline6">2.1. Learning C++: What Lies Before You</a></li>
<li><a href="#orgheadline7">2.2. The Origins of C++: A Little History</a></li>
<li><a href="#orgheadline8">2.3. Portability and Standards</a></li>
<li><a href="#orgheadline9">2.4. The Mechanics of Creating a Program</a></li>
</ul>
</li>
<li><a href="#orgheadline16">3. SETTING OUT TO C++</a>
<ul>
<li><a href="#orgheadline11">3.1. C++ Initiation</a></li>
<li><a href="#orgheadline13">3.2. C++ Statements</a></li>
<li><a href="#orgheadline14">3.3. More C++ Statements</a></li>
<li><a href="#orgheadline15">3.4. Functions</a></li>
</ul>
</li>
<li><a href="#orgheadline27">4. DEALING WITH DATA</a>
<ul>
<li><a href="#orgheadline23">4.1. Simple Variables</a></li>
<li><a href="#orgheadline24">4.2. The const Qualifier</a></li>
<li><a href="#orgheadline25">4.3. Floating-Point Numbers</a></li>
<li><a href="#orgheadline26">4.4. C++ Arithmetic Operators</a></li>
</ul>
</li>
<li><a href="#orgheadline37">5. COMPOUND TYPES</a>
<ul>
<li><a href="#orgheadline28">5.1. Introducing Arrays</a></li>
<li><a href="#orgheadline29">5.2. Strings</a></li>
<li><a href="#orgheadline30">5.3. Introducing the string Class</a></li>
<li><a href="#orgheadline31">5.4. Introducing Structures</a></li>
<li><a href="#orgheadline32">5.5. Unions</a></li>
<li><a href="#orgheadline33">5.6. Enumerations</a></li>
<li><a href="#orgheadline34">5.7. Pointers and the Free Store</a></li>
<li><a href="#orgheadline36">5.8. Pointers, Arrays, and Pointer Arithmetic</a></li>
</ul>
</li>
<li><a href="#orgheadline44">6. LOOPS AND RELATIONAL EXPRESSIONS</a>
<ul>
<li><a href="#orgheadline38">6.1. Introducing for Loops</a></li>
<li><a href="#orgheadline39">6.2. Relational Expressions</a></li>
<li><a href="#orgheadline40">6.3. The while Loop</a></li>
<li><a href="#orgheadline41">6.4. The do while Loop</a></li>
<li><a href="#orgheadline42">6.5. Loops and Text Input</a></li>
<li><a href="#orgheadline43">6.6. Nested Loops and Two-Dimensional Arrays</a></li>
</ul>
</li>
<li><a href="#orgheadline53">7. BRANCHING STATEMENTS AND LOGICAL OPERATORS</a>
<ul>
<li><a href="#orgheadline45">7.1. The if Statement</a></li>
<li><a href="#orgheadline46">7.2. Logical Expressions</a></li>
<li><a href="#orgheadline47">7.3. The cctype Library of Character Functions</a></li>
<li><a href="#orgheadline48">7.4. The ?: Operator</a></li>
<li><a href="#orgheadline49">7.5. The switch Statement</a></li>
<li><a href="#orgheadline50">7.6. The break and continue Statements</a></li>
<li><a href="#orgheadline51">7.7. Number-Reading Loops</a></li>
<li><a href="#orgheadline52">7.8. Simple File Input/Output</a></li>
</ul>
</li>
<li><a href="#orgheadline63">8. FUNCTIONS: C++’S PROGRAMMING MODULES</a>
<ul>
<li><a href="#orgheadline54">8.1. Function Review</a></li>
<li><a href="#orgheadline55">8.2. Function Arguments and Passing by Value</a></li>
<li><a href="#orgheadline56">8.3. Functions and Arrays</a></li>
<li><a href="#orgheadline57">8.4. Functions and Two-Dimensional Arrays</a></li>
<li><a href="#orgheadline58">8.5. Functions and C-Style Strings</a></li>
<li><a href="#orgheadline59">8.6. Functions and Structures</a></li>
<li><a href="#orgheadline60">8.7. Functions and string Class Objects</a></li>
<li><a href="#orgheadline61">8.8. Recursion</a></li>
<li><a href="#orgheadline62">8.9. Pointers to Functions</a></li>
</ul>
</li>
<li><a href="#orgheadline69">9. ADVENTURES IN FUNCTIONS</a>
<ul>
<li><a href="#orgheadline64">9.1. C++ Inline Functions</a></li>
<li><a href="#orgheadline65">9.2. Reference Variables</a></li>
<li><a href="#orgheadline66">9.3. Default Arguments</a></li>
<li><a href="#orgheadline67">9.4. Function Overloading</a></li>
<li><a href="#orgheadline68">9.5. Function Templates</a></li>
</ul>
</li>
<li><a href="#orgheadline74">10. MEMORY MODELS AND NAMESPACES</a>
<ul>
<li><a href="#orgheadline70">10.1. Separate Compilation</a></li>
<li><a href="#orgheadline71">10.2. Storage Duration, Scope, and Linkage</a></li>
<li><a href="#orgheadline72">10.3. The Placement new Operator</a></li>
<li><a href="#orgheadline73">10.4. Namespaces</a></li>
</ul>
</li>
<li><a href="#orgheadline83">11. OBJECTS AND CLASSES</a>
<ul>
<li><a href="#orgheadline75">11.1. Procedural and Object-Oriented Programming</a></li>
<li><a href="#orgheadline76">11.2. Abstraction and Classes</a></li>
<li><a href="#orgheadline77">11.3. Class Constructors and Destructors</a></li>
<li><a href="#orgheadline78">11.4. Knowing Your Objects: The this Pointer</a></li>
<li><a href="#orgheadline79">11.5. An Array of Objects</a></li>
<li><a href="#orgheadline80">11.6. The Interface and Implementation Revisited</a></li>
<li><a href="#orgheadline81">11.7. Class Scope</a></li>
<li><a href="#orgheadline82">11.8. Abstract Data Types</a></li>
</ul>
</li>
<li><a href="#orgheadline90">12. WORKING WITH CLASSES</a>
<ul>
<li><a href="#orgheadline84">12.1. Operator Overloading</a></li>
<li><a href="#orgheadline85">12.2. Time on Our Hands: Developing an Operator Overloading Example</a></li>
<li><a href="#orgheadline86">12.3. Introducing Friends</a></li>
<li><a href="#orgheadline87">12.4. Overloaded Operators: Member Versus Nonmember Functions</a></li>
<li><a href="#orgheadline88">12.5. More Overloading: A Vector Class</a></li>
<li><a href="#orgheadline89">12.6. Automatic Conversions and Type Casts for Classes</a></li>
</ul>
</li>
<li><a href="#orgheadline93">13. CLASSES AND DYNAMIC MEMORY ALLOCATION</a>
<ul>
<li><a href="#orgheadline91">13.1. Dynamic Memory and Classes</a></li>
<li><a href="#orgheadline92">13.2. A Queue Simulation</a></li>
</ul>
</li>
<li><a href="#orgheadline101">14. CLASS INHERITANCE</a>
<ul>
<li><a href="#orgheadline94">14.1. Beginning with a Simple Base Class</a></li>
<li><a href="#orgheadline95">14.2. Inheritance: An Is-a Relationship</a></li>
<li><a href="#orgheadline96">14.3. Polymorphic Public Inheritance</a></li>
<li><a href="#orgheadline97">14.4. Access Control: protected</a></li>
<li><a href="#orgheadline98">14.5. Abstract Base Classes</a></li>
<li><a href="#orgheadline99">14.6. Inheritance and Dynamic Memory Allocation</a></li>
<li><a href="#orgheadline100">14.7. Class Design Review</a></li>
</ul>
</li>
<li><a href="#orgheadline106">15. REUSING CODE IN C++</a>
<ul>
<li><a href="#orgheadline102">15.1. Classes with Object Members</a></li>
<li><a href="#orgheadline103">15.2. Private Inheritance</a></li>
<li><a href="#orgheadline104">15.3. Multiple Inheritance</a></li>
<li><a href="#orgheadline105">15.4. Class Templates</a></li>
</ul>
</li>
<li><a href="#orgheadline112">16. FRIENDS, EXCEPTIONS, AND MORE</a>
<ul>
<li><a href="#orgheadline107">16.1. Friends</a></li>
<li><a href="#orgheadline108">16.2. Nested Classes</a></li>
<li><a href="#orgheadline109">16.3. Exceptions</a></li>
<li><a href="#orgheadline110">16.4. RTTI</a></li>
<li><a href="#orgheadline111">16.5. Type Cast Operators</a></li>
</ul>
</li>
<li><a href="#orgheadline120">17. THE string CLASS AND THE STANDARD TEMPLATE LIBRARY</a>
<ul>
<li><a href="#orgheadline113">17.1. The string Class</a></li>
<li><a href="#orgheadline114">17.2. The auto_ptr Class</a></li>
<li><a href="#orgheadline115">17.3. The STL</a></li>
<li><a href="#orgheadline116">17.4. Generic Programming</a></li>
<li><a href="#orgheadline117">17.5. Function Objects (aka Functors)</a></li>
<li><a href="#orgheadline118">17.6. Algorithms</a></li>
<li><a href="#orgheadline119">17.7. Other Libraries</a></li>
</ul>
</li>
<li><a href="#orgheadline127">18. INPUT, OUTPUT, AND FILES</a>
<ul>
<li><a href="#orgheadline121">18.1. An Overview of C++ Input and Output</a></li>
<li><a href="#orgheadline122">18.2. Output with cout</a></li>
<li><a href="#orgheadline123">18.3. Input with cin</a></li>
<li><a href="#orgheadline124">18.4. File Input and Output</a></li>
<li><a href="#orgheadline125">18.5. Incore Formatting</a></li>
<li><a href="#orgheadline126">18.6. What Now?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-src-container">

<pre class="src src-c++"></pre>
</div>


<p>
<b>C++ Premier Plus</b>
</p>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">1</span> C++ Basics</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.1</span> Variables, Operators and Expressions</h3>
<div class="outline-text-3" id="text-1-1">
</div><ol class="org-ol"><li><a id="orgheadline1"></a>naming<br  /></li>


<li><a id="orgheadline2"></a>logic operation<br  /><div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>&#x2013;i and i&#x2013;.</li>
<li>logical and arithmetic shift.</li>
</ul>
</div></li>

<li><a id="orgheadline3"></a>scientific output expression<br  /><div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>use “%10.1f” as format specifier.</li>
</ul>
</div></li></ol>
</div>
</div>


<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">2</span> GETTING STARTED</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.1</span> Learning C++: What Lies Before You</h3>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.2</span> The Origins of C++: A Little History</h3>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.3</span> Portability and Standards</h3>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.4</span> The Mechanics of Creating a Program</h3>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">3</span> SETTING OUT TO C++</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">3.1</span> C++ Initiation</h3>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.2</span> C++ Statements</h3>
<div class="outline-text-3" id="text-3-2">
</div><ol class="org-ol"><li><a id="orgheadline12"></a>Comments<br  /><div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li>//</li>
<li><i>* *</i></li>
</ul>
</div></li></ol>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.3</span> More C++ Statements</h3>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">3.4</span> Functions</h3>
</div>
</div>



<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27"><span class="section-number-2">4</span> DEALING WITH DATA</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23"><span class="section-number-3">4.1</span> Simple Variables</h3>
<div class="outline-text-3" id="text-4-1">
</div><ol class="org-ol"><li><a id="orgheadline19"></a>Variables:<br  /><ul class="org-ul"><li><a id="orgheadline17"></a>common variables names<br  /><div class="outline-text-5" id="text-orgheadline17">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">price_count_reader</span>;    <span style="color: #75715E;">// </span><span style="color: #75715E;">No abbreviation.</span>
<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">num_errors</span>;            <span style="color: #75715E;">// </span><span style="color: #75715E;">"num" is a widespread convention.</span>
<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">num_dns_connections</span>;   <span style="color: #75715E;">// </span><span style="color: #75715E;">Most people know what "DNS" stands for.</span>
</pre>
</div>
</div></li>

<li><a id="orgheadline18"></a>Class Data Members<br  /><div class="outline-text-5" id="text-orgheadline18">
<p>
Data members of classes, both static and non-static, are named like ordinary nonmember variables, but with a trailing underscore.
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #F92672;">class</span> <span style="color: #66D9EF;">TableInfo</span> <span style="color: #AE81FF;">{</span>
  ...
 <span style="color: #F92672;">private</span>:
  <span style="color: #66D9EF;">string</span> <span style="color: #FD971F;">table_name_</span>;  <span style="color: #75715E;">// </span><span style="color: #75715E;">OK - underscore at end.</span>
  <span style="color: #66D9EF;">string</span> <span style="color: #FD971F;">tablename_</span>;   <span style="color: #75715E;">// </span><span style="color: #75715E;">OK.</span>
  <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">Pool</span><span style="color: #66D9EF;">&lt;</span><span style="color: #66D9EF;">TableInfo</span><span style="color: #66D9EF;">&gt;</span>* <span style="color: #FD971F;">pool_</span>;  <span style="color: #75715E;">// </span><span style="color: #75715E;">OK.</span>
<span style="color: #AE81FF;">}</span>;
</pre>
</div>
</div></li></ul></li>
