CS/C++/C++.org
*** Constant Names
Variables declared constexpr or const, and whose value is fixed for the duration of the program, are named with a leading "k" followed by mixed case. For example:
#+begin_src c++
const int kDaysInAWeek = 7;
#+end_src

*** Function Names
#+begin_src c++ :tangle yes
AddTableEntry()
DeleteUrl()
OpenFileOrDie()
#+end_src

*** File Names
- my_useful_class.cc
- my-useful-class.cc
- myusefulclass.cc
- myusefulclass_test.cc // _unittest and _regtest are deprecated.
** The const Qualifier
** Floating-Point Numbers
** C++ Arithmetic Operators



* COMPOUND TYPES
** Introducing Arrays
** Strings
** Introducing the string Class
** Introducing Structures
** Unions
** Enumerations
** Pointers and the Free Store
** Pointers, Arrays, and Pointer Arithmetic
*** swap value of two variables using pointers
#+begin_src c++
#include <stdio.h>

void Swap(int* a, int* b)
{
	int temp;		//use the variable temp to store one value.
	temp = (*b);	//temp equals to content of pointer b
	(*b) = (*a);	//pointer b equals to content of pointer a
	(*a) = temp;	//content of pointer a equals to temp

}
int main()
{
	int i = 123, j = 456;
	int* x = &i;	//x points to i
	int* y = &j;	//y points to j
	printf("Before swapping: i = %d, j = %d\n",i , j);

	Swap(x, y);
	printf("After swapping: i = %d, j = %d\n",i , j);
return 0;
}
#+end_src


* LOOPS AND RELATIONAL EXPRESSIONS
** Introducing for Loops
** Relational Expressions
** The while Loop
** The do while Loop
** Loops and Text Input
** Nested Loops and Two-Dimensional Arrays



* BRANCHING STATEMENTS AND LOGICAL OPERATORS
** The if Statement
** Logical Expressions
** The cctype Library of Character Functions
** The ?: Operator
** The switch Statement
** The break and continue Statements
** Number-Reading Loops
** Simple File Input/Output



* FUNCTIONS: C++’S PROGRAMMING MODULES
** Function Review
** Function Arguments and Passing by Value
** Functions and Arrays
** Functions and Two-Dimensional Arrays
** Functions and C-Style Strings
** Functions and Structures
** Functions and string Class Objects
** Recursion
** Pointers to Functions



* ADVENTURES IN FUNCTIONS
** C++ Inline Functions
** Reference Variables
** Default Arguments
** Function Overloading
** Function Templates



* MEMORY MODELS AND NAMESPACES
** Separate Compilation
** Storage Duration, Scope, and Linkage
** The Placement new Operator
** Namespaces



* OBJECTS AND CLASSES
** Procedural and Object-Oriented Programming
** Abstraction and Classes
** Class Constructors and Destructors
** Knowing Your Objects: The this Pointer
