docs/CS/C++/C++.html

<li><a id="orgheadline20"></a>Constant Names<br  /><div class="outline-text-4" id="text-4-1-2">
<p>
Variables declared constexpr or const, and whose value is fixed for the duration of the program, are named with a leading "k" followed by mixed case. For example:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">kDaysInAWeek</span> = <span style="color: #AE81FF;">7</span>;
</pre>
</div>
</div></li>

<li><a id="orgheadline21"></a>Function Names<br  /><div class="outline-text-4" id="text-4-1-3">
<div class="org-src-container">

<pre class="src src-c++">AddTableEntry<span style="color: #AE81FF;">()</span>
DeleteUrl<span style="color: #AE81FF;">()</span>
OpenFileOrDie<span style="color: #AE81FF;">()</span>
</pre>
</div>
</div></li>

<li><a id="orgheadline22"></a>File Names<br  /><div class="outline-text-4" id="text-4-1-4">
<ul class="org-ul">
<li>my_useful_class.cc</li>
<li>my-useful-class.cc</li>
<li>myusefulclass.cc</li>
<li>myusefulclass_test.cc // _unittest and _regtest are deprecated.</li>
</ul>
</div></li></ol>
</div>
<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">4.2</span> The const Qualifier</h3>
</div>
<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">4.3</span> Floating-Point Numbers</h3>
</div>
<div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26"><span class="section-number-3">4.4</span> C++ Arithmetic Operators</h3>
</div>
</div>



<div id="outline-container-orgheadline37" class="outline-2">
<h2 id="orgheadline37"><span class="section-number-2">5</span> COMPOUND TYPES</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">5.1</span> Introducing Arrays</h3>
</div>
<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29"><span class="section-number-3">5.2</span> Strings</h3>
</div>
<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">5.3</span> Introducing the string Class</h3>
</div>
<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">5.4</span> Introducing Structures</h3>
</div>
<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">5.5</span> Unions</h3>
</div>
<div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">5.6</span> Enumerations</h3>
</div>
<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34"><span class="section-number-3">5.7</span> Pointers and the Free Store</h3>
</div>
<div id="outline-container-orgheadline36" class="outline-3">
<h3 id="orgheadline36"><span class="section-number-3">5.8</span> Pointers, Arrays, and Pointer Arithmetic</h3>
<div class="outline-text-3" id="text-5-8">
</div><ol class="org-ol"><li><a id="orgheadline35"></a>swap value of two variables using pointers<br  /><div class="outline-text-4" id="text-5-8-1">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;stdio.h&gt;</span>

<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">Swap</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span>* <span style="color: #FD971F;">a</span>, <span style="color: #66D9EF;">int</span>* <span style="color: #FD971F;">b</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
  <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">temp</span>;   <span style="color: #75715E;">//</span><span style="color: #75715E;">use the variable temp to store one value.</span>
  temp = <span style="color: #66D9EF;">(</span>*b<span style="color: #66D9EF;">)</span>;  <span style="color: #75715E;">//</span><span style="color: #75715E;">temp equals to content of pointer b</span>
  <span style="color: #66D9EF;">(</span>*b<span style="color: #66D9EF;">)</span> = <span style="color: #66D9EF;">(</span>*a<span style="color: #66D9EF;">)</span>;  <span style="color: #75715E;">//</span><span style="color: #75715E;">pointer b equals to content of pointer a</span>
  <span style="color: #66D9EF;">(</span>*a<span style="color: #66D9EF;">)</span> = temp;  <span style="color: #75715E;">//</span><span style="color: #75715E;">content of pointer a equals to temp</span>

<span style="color: #AE81FF;">}</span>
<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span><span style="color: #AE81FF;">()</span>
<span style="color: #AE81FF;">{</span>
  <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span> = <span style="color: #AE81FF;">123</span>, <span style="color: #FD971F;">j</span> = <span style="color: #AE81FF;">456</span>;
  <span style="color: #66D9EF;">int</span>* <span style="color: #FD971F;">x</span> = &amp;i;  <span style="color: #75715E;">//</span><span style="color: #75715E;">x points to i</span>
  <span style="color: #66D9EF;">int</span>* <span style="color: #FD971F;">y</span> = &amp;j;  <span style="color: #75715E;">//</span><span style="color: #75715E;">y points to j</span>
  printf<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"Before swapping: i = %d, j = %d\n"</span>,i , j<span style="color: #66D9EF;">)</span>;

  Swap<span style="color: #66D9EF;">(</span>x, y<span style="color: #66D9EF;">)</span>;
  printf<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"After swapping: i = %d, j = %d\n"</span>,i , j<span style="color: #66D9EF;">)</span>;
<span style="color: #F92672;">return</span> <span style="color: #AE81FF;">0</span>;
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div></li></ol>
</div>
</div>


<div id="outline-container-orgheadline44" class="outline-2">
<h2 id="orgheadline44"><span class="section-number-2">6</span> LOOPS AND RELATIONAL EXPRESSIONS</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgheadline38" class="outline-3">
<h3 id="orgheadline38"><span class="section-number-3">6.1</span> Introducing for Loops</h3>
</div>
<div id="outline-container-orgheadline39" class="outline-3">
<h3 id="orgheadline39"><span class="section-number-3">6.2</span> Relational Expressions</h3>
</div>
<div id="outline-container-orgheadline40" class="outline-3">
<h3 id="orgheadline40"><span class="section-number-3">6.3</span> The while Loop</h3>
</div>
<div id="outline-container-orgheadline41" class="outline-3">
<h3 id="orgheadline41"><span class="section-number-3">6.4</span> The do while Loop</h3>
</div>
<div id="outline-container-orgheadline42" class="outline-3">
<h3 id="orgheadline42"><span class="section-number-3">6.5</span> Loops and Text Input</h3>
</div>
<div id="outline-container-orgheadline43" class="outline-3">
<h3 id="orgheadline43"><span class="section-number-3">6.6</span> Nested Loops and Two-Dimensional Arrays</h3>
</div>
</div>



<div id="outline-container-orgheadline53" class="outline-2">
<h2 id="orgheadline53"><span class="section-number-2">7</span> BRANCHING STATEMENTS AND LOGICAL OPERATORS</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgheadline45" class="outline-3">
<h3 id="orgheadline45"><span class="section-number-3">7.1</span> The if Statement</h3>
</div>
<div id="outline-container-orgheadline46" class="outline-3">
<h3 id="orgheadline46"><span class="section-number-3">7.2</span> Logical Expressions</h3>
</div>
<div id="outline-container-orgheadline47" class="outline-3">
<h3 id="orgheadline47"><span class="section-number-3">7.3</span> The cctype Library of Character Functions</h3>
</div>
<div id="outline-container-orgheadline48" class="outline-3">
<h3 id="orgheadline48"><span class="section-number-3">7.4</span> The ?: Operator</h3>
</div>
<div id="outline-container-orgheadline49" class="outline-3">
<h3 id="orgheadline49"><span class="section-number-3">7.5</span> The switch Statement</h3>
</div>
<div id="outline-container-orgheadline50" class="outline-3">
<h3 id="orgheadline50"><span class="section-number-3">7.6</span> The break and continue Statements</h3>
</div>
<div id="outline-container-orgheadline51" class="outline-3">
<h3 id="orgheadline51"><span class="section-number-3">7.7</span> Number-Reading Loops</h3>
</div>
<div id="outline-container-orgheadline52" class="outline-3">
<h3 id="orgheadline52"><span class="section-number-3">7.8</span> Simple File Input/Output</h3>
</div>
</div>



<div id="outline-container-orgheadline63" class="outline-2">
<h2 id="orgheadline63"><span class="section-number-2">8</span> FUNCTIONS: C++’S PROGRAMMING MODULES</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orgheadline54" class="outline-3">
<h3 id="orgheadline54"><span class="section-number-3">8.1</span> Function Review</h3>
</div>
<div id="outline-container-orgheadline55" class="outline-3">
<h3 id="orgheadline55"><span class="section-number-3">8.2</span> Function Arguments and Passing by Value</h3>
</div>
<div id="outline-container-orgheadline56" class="outline-3">
<h3 id="orgheadline56"><span class="section-number-3">8.3</span> Functions and Arrays</h3>
</div>
<div id="outline-container-orgheadline57" class="outline-3">
<h3 id="orgheadline57"><span class="section-number-3">8.4</span> Functions and Two-Dimensional Arrays</h3>
</div>
<div id="outline-container-orgheadline58" class="outline-3">
<h3 id="orgheadline58"><span class="section-number-3">8.5</span> Functions and C-Style Strings</h3>
</div>
<div id="outline-container-orgheadline59" class="outline-3">
<h3 id="orgheadline59"><span class="section-number-3">8.6</span> Functions and Structures</h3>
</div>
<div id="outline-container-orgheadline60" class="outline-3">
<h3 id="orgheadline60"><span class="section-number-3">8.7</span> Functions and string Class Objects</h3>
</div>
<div id="outline-container-orgheadline61" class="outline-3">
<h3 id="orgheadline61"><span class="section-number-3">8.8</span> Recursion</h3>
</div>
<div id="outline-container-orgheadline62" class="outline-3">
<h3 id="orgheadline62"><span class="section-number-3">8.9</span> Pointers to Functions</h3>
</div>
</div>



<div id="outline-container-orgheadline69" class="outline-2">
<h2 id="orgheadline69"><span class="section-number-2">9</span> ADVENTURES IN FUNCTIONS</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-orgheadline64" class="outline-3">
<h3 id="orgheadline64"><span class="section-number-3">9.1</span> C++ Inline Functions</h3>
</div>
<div id="outline-container-orgheadline65" class="outline-3">
<h3 id="orgheadline65"><span class="section-number-3">9.2</span> Reference Variables</h3>
</div>
<div id="outline-container-orgheadline66" class="outline-3">
<h3 id="orgheadline66"><span class="section-number-3">9.3</span> Default Arguments</h3>
</div>
<div id="outline-container-orgheadline67" class="outline-3">
<h3 id="orgheadline67"><span class="section-number-3">9.4</span> Function Overloading</h3>
</div>
<div id="outline-container-orgheadline68" class="outline-3">
<h3 id="orgheadline68"><span class="section-number-3">9.5</span> Function Templates</h3>
</div>
</div>



<div id="outline-container-orgheadline74" class="outline-2">
<h2 id="orgheadline74"><span class="section-number-2">10</span> MEMORY MODELS AND NAMESPACES</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-orgheadline70" class="outline-3">
<h3 id="orgheadline70"><span class="section-number-3">10.1</span> Separate Compilation</h3>
</div>
<div id="outline-container-orgheadline71" class="outline-3">
<h3 id="orgheadline71"><span class="section-number-3">10.2</span> Storage Duration, Scope, and Linkage</h3>
</div>
<div id="outline-container-orgheadline72" class="outline-3">
<h3 id="orgheadline72"><span class="section-number-3">10.3</span> The Placement new Operator</h3>
</div>
<div id="outline-container-orgheadline73" class="outline-3">
<h3 id="orgheadline73"><span class="section-number-3">10.4</span> Namespaces</h3>
</div>
</div>



<div id="outline-container-orgheadline83" class="outline-2">
<h2 id="orgheadline83"><span class="section-number-2">11</span> OBJECTS AND CLASSES</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-orgheadline75" class="outline-3">
<h3 id="orgheadline75"><span class="section-number-3">11.1</span> Procedural and Object-Oriented Programming</h3>
</div>
<div id="outline-container-orgheadline76" class="outline-3">
<h3 id="orgheadline76"><span class="section-number-3">11.2</span> Abstraction and Classes</h3>
</div>
<div id="outline-container-orgheadline77" class="outline-3">
<h3 id="orgheadline77"><span class="section-number-3">11.3</span> Class Constructors and Destructors</h3>
</div>
<div id="outline-container-orgheadline78" class="outline-3">
<h3 id="orgheadline78"><span class="section-number-3">11.4</span> Knowing Your Objects: The this Pointer</h3>
</div>
