CS/C++/C++.org
** An Array of Objects
** The Interface and Implementation Revisited
** Class Scope
** Abstract Data Types



* WORKING WITH CLASSES
** Operator Overloading
** Time on Our Hands: Developing an Operator Overloading Example
** Introducing Friends
** Overloaded Operators: Member Versus Nonmember Functions
** More Overloading: A Vector Class
** Automatic Conversions and Type Casts for Classes



* CLASSES AND DYNAMIC MEMORY ALLOCATION
** Dynamic Memory and Classes
** A Queue Simulation



* CLASS INHERITANCE
** Beginning with a Simple Base Class
** Inheritance: An Is-a Relationship
** Polymorphic Public Inheritance
** Access Control: protected
** Abstract Base Classes
** Inheritance and Dynamic Memory Allocation
** Class Design Review



* REUSING CODE IN C++
** Classes with Object Members
** Private Inheritance
** Multiple Inheritance
** Class Templates



* FRIENDS, EXCEPTIONS, AND MORE
** Friends
** Nested Classes
** Exceptions
** RTTI
** Type Cast Operators



* THE string CLASS AND THE STANDARD TEMPLATE LIBRARY
** The string Class
** The auto_ptr Class
** The STL
** Generic Programming
** Function Objects (aka Functors)
** Algorithms
** Other Libraries



* INPUT, OUTPUT, AND FILES
** An Overview of C++ Input and Output
** Output with cout
** Input with cin
** File Input and Output
** Incore Formatting
** What Now?
