docs/CS/C++/C++.html
<div id="outline-container-orgheadline79" class="outline-3">
<h3 id="orgheadline79"><span class="section-number-3">11.5</span> An Array of Objects</h3>
</div>
<div id="outline-container-orgheadline80" class="outline-3">
<h3 id="orgheadline80"><span class="section-number-3">11.6</span> The Interface and Implementation Revisited</h3>
</div>
<div id="outline-container-orgheadline81" class="outline-3">
<h3 id="orgheadline81"><span class="section-number-3">11.7</span> Class Scope</h3>
</div>
<div id="outline-container-orgheadline82" class="outline-3">
<h3 id="orgheadline82"><span class="section-number-3">11.8</span> Abstract Data Types</h3>
</div>
</div>



<div id="outline-container-orgheadline90" class="outline-2">
<h2 id="orgheadline90"><span class="section-number-2">12</span> WORKING WITH CLASSES</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-orgheadline84" class="outline-3">
<h3 id="orgheadline84"><span class="section-number-3">12.1</span> Operator Overloading</h3>
</div>
<div id="outline-container-orgheadline85" class="outline-3">
<h3 id="orgheadline85"><span class="section-number-3">12.2</span> Time on Our Hands: Developing an Operator Overloading Example</h3>
</div>
<div id="outline-container-orgheadline86" class="outline-3">
<h3 id="orgheadline86"><span class="section-number-3">12.3</span> Introducing Friends</h3>
</div>
<div id="outline-container-orgheadline87" class="outline-3">
<h3 id="orgheadline87"><span class="section-number-3">12.4</span> Overloaded Operators: Member Versus Nonmember Functions</h3>
</div>
<div id="outline-container-orgheadline88" class="outline-3">
<h3 id="orgheadline88"><span class="section-number-3">12.5</span> More Overloading: A Vector Class</h3>
</div>
<div id="outline-container-orgheadline89" class="outline-3">
<h3 id="orgheadline89"><span class="section-number-3">12.6</span> Automatic Conversions and Type Casts for Classes</h3>
</div>
</div>



<div id="outline-container-orgheadline93" class="outline-2">
<h2 id="orgheadline93"><span class="section-number-2">13</span> CLASSES AND DYNAMIC MEMORY ALLOCATION</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-orgheadline91" class="outline-3">
<h3 id="orgheadline91"><span class="section-number-3">13.1</span> Dynamic Memory and Classes</h3>
</div>
<div id="outline-container-orgheadline92" class="outline-3">
<h3 id="orgheadline92"><span class="section-number-3">13.2</span> A Queue Simulation</h3>
</div>
</div>



<div id="outline-container-orgheadline101" class="outline-2">
<h2 id="orgheadline101"><span class="section-number-2">14</span> CLASS INHERITANCE</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-orgheadline94" class="outline-3">
<h3 id="orgheadline94"><span class="section-number-3">14.1</span> Beginning with a Simple Base Class</h3>
</div>
<div id="outline-container-orgheadline95" class="outline-3">
<h3 id="orgheadline95"><span class="section-number-3">14.2</span> Inheritance: An Is-a Relationship</h3>
</div>
<div id="outline-container-orgheadline96" class="outline-3">
<h3 id="orgheadline96"><span class="section-number-3">14.3</span> Polymorphic Public Inheritance</h3>
</div>
<div id="outline-container-orgheadline97" class="outline-3">
<h3 id="orgheadline97"><span class="section-number-3">14.4</span> Access Control: protected</h3>
</div>
<div id="outline-container-orgheadline98" class="outline-3">
<h3 id="orgheadline98"><span class="section-number-3">14.5</span> Abstract Base Classes</h3>
</div>
<div id="outline-container-orgheadline99" class="outline-3">
<h3 id="orgheadline99"><span class="section-number-3">14.6</span> Inheritance and Dynamic Memory Allocation</h3>
</div>
<div id="outline-container-orgheadline100" class="outline-3">
<h3 id="orgheadline100"><span class="section-number-3">14.7</span> Class Design Review</h3>
</div>
</div>



<div id="outline-container-orgheadline106" class="outline-2">
<h2 id="orgheadline106"><span class="section-number-2">15</span> REUSING CODE IN C++</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-orgheadline102" class="outline-3">
<h3 id="orgheadline102"><span class="section-number-3">15.1</span> Classes with Object Members</h3>
</div>
<div id="outline-container-orgheadline103" class="outline-3">
<h3 id="orgheadline103"><span class="section-number-3">15.2</span> Private Inheritance</h3>
</div>
<div id="outline-container-orgheadline104" class="outline-3">
<h3 id="orgheadline104"><span class="section-number-3">15.3</span> Multiple Inheritance</h3>
</div>
<div id="outline-container-orgheadline105" class="outline-3">
<h3 id="orgheadline105"><span class="section-number-3">15.4</span> Class Templates</h3>
</div>
</div>



<div id="outline-container-orgheadline112" class="outline-2">
<h2 id="orgheadline112"><span class="section-number-2">16</span> FRIENDS, EXCEPTIONS, AND MORE</h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-orgheadline107" class="outline-3">
<h3 id="orgheadline107"><span class="section-number-3">16.1</span> Friends</h3>
</div>
<div id="outline-container-orgheadline108" class="outline-3">
<h3 id="orgheadline108"><span class="section-number-3">16.2</span> Nested Classes</h3>
</div>
<div id="outline-container-orgheadline109" class="outline-3">
<h3 id="orgheadline109"><span class="section-number-3">16.3</span> Exceptions</h3>
</div>
<div id="outline-container-orgheadline110" class="outline-3">
<h3 id="orgheadline110"><span class="section-number-3">16.4</span> RTTI</h3>
</div>
<div id="outline-container-orgheadline111" class="outline-3">
<h3 id="orgheadline111"><span class="section-number-3">16.5</span> Type Cast Operators</h3>
</div>
</div>



<div id="outline-container-orgheadline120" class="outline-2">
<h2 id="orgheadline120"><span class="section-number-2">17</span> THE string CLASS AND THE STANDARD TEMPLATE LIBRARY</h2>
<div class="outline-text-2" id="text-17">
</div><div id="outline-container-orgheadline113" class="outline-3">
<h3 id="orgheadline113"><span class="section-number-3">17.1</span> The string Class</h3>
</div>
<div id="outline-container-orgheadline114" class="outline-3">
<h3 id="orgheadline114"><span class="section-number-3">17.2</span> The auto_ptr Class</h3>
</div>
<div id="outline-container-orgheadline115" class="outline-3">
<h3 id="orgheadline115"><span class="section-number-3">17.3</span> The STL</h3>
</div>
<div id="outline-container-orgheadline116" class="outline-3">
<h3 id="orgheadline116"><span class="section-number-3">17.4</span> Generic Programming</h3>
</div>
<div id="outline-container-orgheadline117" class="outline-3">
<h3 id="orgheadline117"><span class="section-number-3">17.5</span> Function Objects (aka Functors)</h3>
</div>
<div id="outline-container-orgheadline118" class="outline-3">
<h3 id="orgheadline118"><span class="section-number-3">17.6</span> Algorithms</h3>
</div>
<div id="outline-container-orgheadline119" class="outline-3">
<h3 id="orgheadline119"><span class="section-number-3">17.7</span> Other Libraries</h3>
</div>
</div>



<div id="outline-container-orgheadline127" class="outline-2">
<h2 id="orgheadline127"><span class="section-number-2">18</span> INPUT, OUTPUT, AND FILES</h2>
<div class="outline-text-2" id="text-18">
</div><div id="outline-container-orgheadline121" class="outline-3">
<h3 id="orgheadline121"><span class="section-number-3">18.1</span> An Overview of C++ Input and Output</h3>
</div>
<div id="outline-container-orgheadline122" class="outline-3">
<h3 id="orgheadline122"><span class="section-number-3">18.2</span> Output with cout</h3>
</div>
<div id="outline-container-orgheadline123" class="outline-3">
<h3 id="orgheadline123"><span class="section-number-3">18.3</span> Input with cin</h3>
</div>
<div id="outline-container-orgheadline124" class="outline-3">
<h3 id="orgheadline124"><span class="section-number-3">18.4</span> File Input and Output</h3>
</div>
<div id="outline-container-orgheadline125" class="outline-3">
<h3 id="orgheadline125"><span class="section-number-3">18.5</span> Incore Formatting</h3>
</div>
<div id="outline-container-orgheadline126" class="outline-3">
<h3 id="orgheadline126"><span class="section-number-3">18.6</span> What Now?</h3>
</div>
</div>
</div>
</body>
</html>
